{"keras_version": "2.1.0", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "name": "conv2d_1", "data_format": "channels_last", "use_bias": true, "filters": 64, "trainable": true, "batch_input_shape": [null, 32, 32, 3], "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2", "data_format": "channels_last", "use_bias": true, "filters": 64, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_3", "data_format": "channels_last", "use_bias": true, "filters": 128, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_4", "data_format": "channels_last", "use_bias": true, "filters": 128, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_5", "data_format": "channels_last", "use_bias": true, "filters": 256, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_6", "data_format": "channels_last", "use_bias": true, "filters": 256, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_7", "data_format": "channels_last", "use_bias": true, "filters": 256, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_8", "data_format": "channels_last", "use_bias": true, "filters": 512, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_9", "data_format": "channels_last", "use_bias": true, "filters": 512, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_10", "data_format": "channels_last", "use_bias": true, "filters": 512, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 2048, "name": "dense_1", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 2048, "name": "dense_2", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 10, "name": "dense_3", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}]}